In [22]:
import pyodbc as pyd
import pandas as pd

In [24]:
import pandas as pd
import pyodbc

# Replace the server and database details
server_name = 'DESKTOP-OA5S7LD\SQLEXPRESS'  # Adjust this to your SQL Server instance
database_name = 'Pizzas_database'

# Connection string with Windows Authentication
connection_string = f'DRIVER={{SQL Server}};SERVER={server_name};DATABASE={database_name};Trusted_Connection=yes'

# Try to connect
try:
    conn = pyodbc.connect(connection_string)
    cursor = conn.cursor()

    # Read data from the "pizza_sales" table into a DataFrame
    table_name = 'pizza_sales'
    sql_query = f"SELECT * FROM {table_name}"
    df = pd.read_sql(sql_query, conn)

    # Print the DataFrame or perform further analysis
    print(df)

except Exception as e:
    print(f"Error: {e}")

C:\Users\admin\AppData\Local\Temp\ipykernel_18940\2298879777.py:19: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(sql_query, conn)

       pizza_id  order_id  pizza_name_id  quantity  order_date  \
0             1         1     hawaiian_m         1  2015-01-01
1             2         2  classic_dlx_m         1  2015-01-01
2             3         2  five_cheese_l         1  2015-01-01
3             4         2    ital_supr_l         1  2015-01-01
4             5         2     mexicana_m         1  2015-01-01
...         ...       ...            ...       ...         ...
48615     48616     21348  ckn_alfredo_m         1  2015-12-31
48616     48617     21348  four_cheese_l         1  2015-12-31
48617     48618     21348   napolitana_s         1  2015-12-31
48618     48619     21349     mexicana_l         1  2015-12-31
48619     48620     21350      bbq_ckn_s         1  2015-12-31

             order_time  unit_price  total_price pizza_size pizza_category  \
0      11:38:36.0000000   13.250000    13.250000          M        Classic
1      11:57:40.0000000   16.000000    16.000000          M        Classic
2      11:57:40.0000000   18.500000    18.500000          L         Veggie
3      11:57:40.0000000   20.750000    20.750000          L        Supreme
4      11:57:40.0000000   16.000000    16.000000          M         Veggie
...                 ...         ...          ...        ...            ...
48615  21:23:10.0000000   16.750000    16.750000          M        Chicken
48616  21:23:10.0000000   17.950001    17.950001          L         Veggie
48617  21:23:10.0000000   12.000000    12.000000          S        Classic
48618  22:09:54.0000000   20.250000    20.250000          L         Veggie
48619  23:02:05.0000000   12.750000    12.750000          S        Chicken

                                       pizza_ingredients  \
0               Sliced Ham, Pineapple, Mozzarella Cheese
1      Pepperoni, Mushrooms, Red Onions, Red Peppers,...
2      Mozzarella Cheese, Provolone Cheese, Smoked Go...
3      Calabrese Salami, Capocollo, Tomatoes, Red Oni...
4      Tomatoes, Red Peppers, Jalapeno Peppers, Red O...
...                                                  ...
48615  Chicken, Red Onions, Red Peppers, Mushrooms, A...
48616  Ricotta Cheese, Gorgonzola Piccante Cheese, Mo...
48617  Tomatoes, Anchovies, Green Olives, Red Onions,...
48618  Tomatoes, Red Peppers, Jalapeno Peppers, Red O...
48619  Barbecued Chicken, Red Peppers, Green Peppers,...

                       pizza_name
0              The Hawaiian Pizza
1        The Classic Deluxe Pizza
2           The Five Cheese Pizza
3       The Italian Supreme Pizza
4              The Mexicana Pizza
...                           ...
48615   The Chicken Alfredo Pizza
48616       The Four Cheese Pizza
48617        The Napolitana Pizza
48618          The Mexicana Pizza
48619  The Barbecue Chicken Pizza

[48620 rows x 12 columns]

# **KPI Requirement**

# Total Revenue

In [26]:
query = ("""SELECT SUM(total_price) as 'Total_revenue' FROM pizza_sales""")


pd.read_sql_query(query, conn, index_col=None)

C:\Users\admin\AppData\Local\Temp\ipykernel_18940\3224157371.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query, conn, index_col=None)

   Total_revenue
0  817860.050838

# Average order value

In [27]:
query = ("""SELECT SUM(total_price)/count(Distinct order_id)  as 'avg_order' FROM pizza_sales""")


pd.read_sql_query(query, conn, index_col=None)

C:\Users\admin\AppData\Local\Temp\ipykernel_18940\607582184.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query, conn, index_col=None)

   avg_order
0  38.307262

# Total quantity Pizza Sold

In [28]:
query = ("""SELECT sum(quantity) as 'total_quantity_sold' FROM pizza_sales""")


pd.read_sql_query(query, conn, index_col=None)

C:\Users\admin\AppData\Local\Temp\ipykernel_18940\364593703.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query, conn, index_col=None)

   total_quantity_sold
0                49574

# Total orders

In [29]:
query = ("""SELECT count(Distinct order_id) as 'Total_orders' FROM pizza_sales""")


pd.read_sql_query(query, conn, index_col=None)

C:\Users\admin\AppData\Local\Temp\ipykernel_18940\4261946161.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query, conn, index_col=None)

   Total_orders
0         21350

# Average Pizzas per Order

In [31]:
query = ("""SELECT sum(quantity)/count(Distinct order_id) as 'Average_Pizzas_per_Order' FROM pizza_sales""")


pd.read_sql_query(query, conn, index_col=None)

C:\Users\admin\AppData\Local\Temp\ipykernel_18940\2434938457.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query, conn, index_col=None)

   Average_Pizzas_per_Order
0                         2

# **Charts Requirement**

# Daily trends for orders

In [33]:
query = ("""
    SELECT DATENAME(WEEKDAY, CONVERT(DATE, order_date, 101)) AS 'order_day', 
           COUNT(DISTINCT order_id) AS 'Total_Orders' 
    FROM pizza_sales 
    GROUP BY DATENAME(WEEKDAY, CONVERT(DATE, order_date, 101));
    """)


pd.read_sql(query, conn)

C:\Users\admin\AppData\Local\Temp\ipykernel_18940\2051360814.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

   order_day  Total_Orders
0   Saturday          3158
1  Wednesday          3024
2     Monday          2794
3     Sunday          2624
4     Friday          3538
5   Thursday          3239
6    Tuesday          2973

# Monthly Trend for Total Orders

In [36]:
query = ("""SELECT DATENAME(MONTH, order_date) as Month_Name , COUNT(DISTINCT order_id) as Total_Orders from pizza_sales GROUP BY DATENAME(MONTH , order_date) ORDER BY Total_Orders DESC""")


pd.read_sql(query, conn)

C:\Users\admin\AppData\Local\Temp\ipykernel_18940\1034052600.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

   Month_Name  Total_Orders
0        July          1935
1         May          1853
2     January          1845
3      August          1841
4       March          1840
5       April          1799
6    November          1792
7        June          1773
8    February          1685
9    December          1680
10  September          1661
11    October          1646

# Percentage of sales by pizza category

In [43]:
query = ("""SELECT pizza_category , sum(total_price) * 100 / (SELECT sum(total_price) from pizza_sales) as 'percentage of sales' from pizza_sales    GROUP BY pizza_category""")


pd.read_sql(query, conn)

C:\Users\admin\AppData\Local\Temp\ipykernel_18940\1929312646.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

  pizza_category  percentage of sales
0        Classic            26.905960
1        Chicken            23.955138
2         Veggie            23.682591
3        Supreme            25.456311

# Percentage of sales by pizza size

In [50]:
query = ("""SELECT pizza_size , sum(total_price), CAST(sum(total_price) * 100 / (SELECT sum(total_price) from pizza_sales) AS DECIMAL(10,2)) as 'percentage_of_sales' from pizza_sales   GROUP BY pizza_size ORDER BY percentage_of_sales desc""")


pd.read_sql(query, conn)

C:\Users\admin\AppData\Local\Temp\ipykernel_18940\1295421370.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

  pizza_size                 percentage_of_sales
0          L  375318.701004                45.89
1          M  249382.250000                30.49
2          S  178076.499813                21.77
3         XL   14076.000000                 1.72
4        XXL    1006.600021                 0.12

# Top 5 best sellers by Revenue , Total Quantity and total orders

In [56]:
query = """select TOP 5  pizza_name,sum(quantity) as 'total' from pizza_sales
group by pizza_name order by total desc """

pd.read_sql_query(query, conn, index_col=None)

C:\Users\admin\AppData\Local\Temp\ipykernel_18940\1513669689.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query, conn, index_col=None)

                   pizza_name  total
0    The Classic Deluxe Pizza   2453
1  The Barbecue Chicken Pizza   2432
2          The Hawaiian Pizza   2422
3         The Pepperoni Pizza   2418
4      The Thai Chicken Pizza   2371

In [57]:
query = """select TOP 5  pizza_name,count(distinct order_id) as 'id' from pizza_sales
group by pizza_name order by id desc """

pd.read_sql_query(query, conn, index_col=None)

C:\Users\admin\AppData\Local\Temp\ipykernel_18940\1279841374.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query, conn, index_col=None)

                   pizza_name    id
0    The Classic Deluxe Pizza  2329
1          The Hawaiian Pizza  2280
2         The Pepperoni Pizza  2278
3  The Barbecue Chicken Pizza  2273
4      The Thai Chicken Pizza  2225